// Lab1.1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{
	std::cout << "First string\n";
	setlocale(LC_CTYPE, "Russian");
	std::cout << "Первая строка\n";
	std::cout << "Вторая строка\n";
	std::cout << "Спецсимволы" "\\ \n";
	int a = 150;
	float b = 15.933;
	char c = 250;
	std::cout << "a=" << a << "\n";
	std::cout << "b=" << b << "\n";
	std::cout << "c=" << c << "\n";

	int date = 12.;
	std::string month = "Май";
	int year = 2003;
	std::cout << date << " " << month << " " << year << "\n";
	float d = 2.3;
	std::string e = "WINDOWS";
	std::cout << d << "\n";
	std::cout << e << "";

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
